{
    "name": "MIDI Input Configuration",
    "icon": "mimi:synlead",
    "category": "mimi:configuration",
    "pages": [
        {
            "type": "text",
            "text": "In order to receive MIDI data in MIMI you must select a MIDI Input Device from your system.$(br2)The MIDI Input Device Configuration GUI allows you to get a list of MIDI devices currently available on your system and select the one to use for MIMI input."
        },
        {
            "type": "text",
            "title": "Setting a Default",
            "text": "You can set a default MIDI device to use for MIMI input in the $(l:configuration_file)MIMI config file$(/l). When a default is set it will be selected when Minecraft starts if it is available.$(br2)Note that the default is set by device ID which may not always be consistent between system restarts if you have more than one available device. If you have a default set but don't receive input check the GUI."
        },
        {
            "type": "text",
            "title": "Physical MIDI Devices",
            "text": "In order to play MIDI data in MIMI you must have at least one compatible MIDI device available on your system.$(br2)If you have a physical MIDI-enabled device (like a digital piano) that should work with a USB to MIDI adapter as long as your system is able to recognize it. For help with connecting a MIDI device to your system see $(l:https://www.musicrepo.com/how-to-connect-midi-keyboard-to-computer/)here$(/l)."
        },
        {
            "type": "text",
            "title": "Loopback Devices",
            "text": "You can also use any MIDI output available on your system as MIDI input into MIMI via a Loopback Device.$(br2)A loopback device is essentially a device that takes a MIDI output and re-broadcasts it as a MIDI input to be used in another MIDI device."
        },
        {
            "type": "text",
            "title": "Loopback Devices",
            "text": "Setting up MIDI loopback varies based on your operating system. Here are some links to get you started:$(br2)$(l)Windows$() - $(l:https://www.tobias-erichsen.de/software/loopmidi.html)loopMIDI$(/l)$(br2)$(l)Mac$() - $(l:https://help.ableton.com/hc/en-us/articles/209774225-Setting-up-a-virtual-MIDI-bus#Mac)Built-in IAC$(/l)$(br2)$(l)Linux$() - This depends on your distribution and some don't play nice with Java. One popular option is $(l:https://jackaudio.org/)JACK$(/l)."
        },
        {
            "type": "text",
            "title": "Software MIDI Devices",
            "text": "If you want to play MIDI files you will need a program that can send output to your loopback device rather than just produce sound. Here are some options:$(br2)$(l)Windows$() - $(l:http://www.vanbasco.com/)vanBasco's Karaoke$(/l)$(br2)$(l)Mac$() - $(l:https://apps.apple.com/us/app/midiplayer-x/id954177929)MIDIPlayerX$(/l)$(br2)$(l)Linux$() - Depends on your distribution so you'll have to search."
        }
    ],
    "sortnum": 2
}