{
    "name": "The Instrument GUI",
    "icon": "minecraft:book",
    "category": "mimi:instruments",
    "pages": [
        {
            "type": "text",
            "text": "MIMI instruments are manually played and configured via the Instrument GUI.$(br2)This GUI provides both the ability to play notes on a piano keyboard and configure the MIDI settings of the instrument.$(br2)Note that at this time the keyboard controls for the instrument GUI are not configurable."
        },
        {
            "type": "text",
            "title": "The Piano Keyboard",
            "text": "The largest component on the instrument GUI is the piano keyboard. This keyboard allows you to manually play notes on your instrument either by clicking the piano keys or pressing the keyboard keys associated with piano key.$(br2)The keyboard displays three octaves of notes at one time but can be shifted up and down."
        },
        {
            "type": "text",
            "title": "The Piano Keyboard",
            "text": "The largest component on the instrument GUI is the piano keyboard. This keyboard allows you to manually play notes on your instrument either by clicking the piano keys or pressing the keyboard keys associated with piano key.$(br2)The keyboard displays three octaves of notes at one time but can be shifted up and down."
        },
        {
            "type": "text",
            "title": "Shifting the Piano",
            "text": "The GUI also shows the controls for shifting the displayed piano up and down so that you can play lower or higher notes.$(br2)You can shift up and down either by a single white note or an entire octave."
        },
        {
            "type": "text",
            "title": "Note Indicators",
            "text": "The note indicators display minimum, maximum, and middles notes on the currently visible portion of the piano.$(br2)The color of the labels corresponds to colored lines on the piano keyboard to show which notes are being labeled."
        },
        {
            "type": "text",
            "title": "Switchboard Slot",
            "text": "The lower half of the GUI shows your current inventory and includes a slot to insert a $(l:overview_switchboard)Switchboard$() into the current instrument.$(br2)Inserting a Switchboard allows you to connect the instrument to a $(l:overview_filecaster)FileCaster$() or enable input from a System MIDI Input device."
        },
        {
            "type": "text",
            "title": "Switchboard Panel",
            "text": "The pencil button next to the Switchboard slot allows you to modify the properties of the current switchboard if one is inserted.$(br2)See the $(l:switchboard_properties)Switchboard Properties$() section of this guide for more information on available Switchboard properties."
        },
        {
            "type": "text",
            "title": "Keyboard Layout",
            "text": "The top right section of the Instrument GUI lets you cycle between keyboard layouts for the piano. The selected layout is saved globally using the $(l:client_file)Config File$(/l), not per-instrument.$(br2)$(l)MIMI$() is the default mode and is a 'floating' mode where the same keys are used regardless of where you are on the keyboard. This mode allows you to play all notes from C0-G10 but only the notes currently visible on your screen."
        },
        {
            "type": "text",
            "title": "Keyboard Layout",
            "text": "$(l)VPiano$() is a mode that uses the same layout as virtualpiano.net and is a 'static' mode where keys are assigned to specific notes and do not follow your current view on the keyboard.$(br2)This mode allows you to play notes from C2-C7 and play notes that are not currently visible on your screen. This mode is case-sensitive so in order to play the black keys you will need to hold Shift."
        }
    ],
    "sortnum": 0
}