{
    "name": "Instrument Properties",
    "icon": "minecraft:name_tag",
    "category": "mimi:instruments",
    "pages": [
        {
            "type": "text",
            "text": "Each instrument has several properties that can be set in the $(l:instruments_gui)Instrument GUI$(/l).$(br2)These properties are saved to the instrument and will apply to all players who use it.$(br2)Note that Block Instruments will lose their saved properties when they are broken."
        },
        {
            "type": "text",
            "title": "MIDI Toggle",
            "text": "This controls whether or not the instrument should respond to MIDI notes from the configured MIDI Source.$(br2)If enabled the instrument will play notes it receives from the configured MIDI Source automatically."
        },
        {
            "type": "text",
            "title": "MIDI Source",
            "text": "This property stores where instrument should receive MIDI messages from and supports several modes.$(br2)Note that if a player transmitter is set as the MIDI Source the player must be within 16 blocks of the instrument for notes to be received."
        },
        {
            "type": "text",
            "title": "MIDI Source",
            "text": "$(l)Public Transmitters$() - The instrument will play notes from any nearby MIDI Transmitters that are set to public mode.$(br2)$(l)Player Transmitter$() - The instrument will play notes from the specified player's MIDI Transmitter if it is set to linked mode (or self mode if linked to your transmitter)."
        },
        {
            "type": "text",
            "title": "MIDI Source",
            "text": "$(br2)$(l)System MIDI Device$() - The instrument will play notes from the configured System MIDI Input Device if it is available.$(br2)"
        },
        {
            "type": "text",
            "title": "MIDI Channels",
            "text": "A MIDI file is able to play 16 different instruments at a time. Each instrument is assigned a number - called a channel - and notes for that instrument are sent to that channel. Each MIMI instrument can choose which channels it should use using the buttons near the top of the Instrument GUI.$(br2)$(l)Channel 10$() is intended for percussion and doesn't usually work well for any other instrument."
        },
        {
            "type": "text",
            "title": "MIDI Channels",
            "text": "When the MIDI Source is set to a System MIDI Input Device you may need to consult the user guide of the device to determine which MIDI Channels it sends its MIDI messages to."
        },
        {
            "type": "text",
            "title": "MIDI Channels",
            "text": "Note that it is generally recommended to enable only some channels at the same time because if the same note is played on multiple enabled channels simultaneously it could cause minor issues with note timing sustain as the note on one channel may last longer than the note on another channel."
        }
    ],
    "sortnum": 0
}