{
    "name": "The Instrument GUI",
    "icon": "minecraft:book",
    "category": "mimi:instruments",
    "pages": [
        {
            "type": "text",
            "text": "MIMI instruments are manually played and configured via the Instrument GUI.$(br2)This GUI provides both the ability to play notes on a piano keyboard and configure the MIDI settings of the instrument.$(br2)Note that at this time the keyboard controls for the instrument GUI are not configurable."
        },
        {
            "type": "text",
            "title": "The Piano Keyboard",
            "text": "The largest component on the instrument GUI is the piano keyboard. This keyboard allows you to manually play notes on your instrument either by clicking the piano keys or pressing the keyboard keys associated with piano key.$(br2)The keyboard displays three octaves of notes at one time but can be shifted up and down."
        },
        {
            "type": "text",
            "title": "Shifting the Piano",
            "text": "To shift the piano you can either click the shift buttons on the right side 'Shift' panel, or use the arrow keys on your keyboard that match the arrow on each shift GUI button.$(br2)Shifting +/- 1 moves the keyboard one natural note (white key) while +/- 7 moves the keyboard one full octave.$(br2)The $(l)ZNote$() indicator displays which note on the piano is mapped to Z on your keyboard."
        },
        {
            "type": "text",
            "title": "Setting the Maestro",
            "text": "The top-left section of the instrument GUI allows you to configure the Maestro linked to the instrument.$(br2)The GUI allows you to see the current linked Maestro and provides buttons to set yourself as the Maestro or clear the linked Maestro.$(br2)To link another player as the Maestro see the $(l:instruments_hand_held)hand-held$(/l) and $(l:instruments_block)block$(/l) instrument chapters."
        },
        {
            "type": "text",
            "title": "MIDI Input Mode",
            "text": "The top-right section of the instrument GUI allows you to configure the MIDI Input mode of the instrument.$(br2)When cycling through the MIDI Input modes only modes that are valid will show up. If there is no system MIDI input device configured then MIDI will not be available, and if there is no linked Maestro then Maestro will not be available."
        },
        {
            "type": "text",
            "title": "MIDI Channel Toggles",
            "text": "The numbered buttons spanning the full length of the GUI are the MIDI channel toggles. These buttons allow you to toggle each MIDI channel on or off for this instrument when it is playing MIDI input.$(br2)Channel 10 is a special color to indicate that it is primarily used for percussion.$(br2)The X and O buttons allow you to clear and enable all channels, respectively."
        }
    ],
    "sortnum": 0
}