{
    "name": "Using MIDI Input",
    "icon": "mimi:synlead",
    "category": "mimi:overview",
    "pages": [
        {
            "type": "text",
            "text": "In addition to manually playing notes via the instrument GUI MIMI also allows you to play notes from a configured system MIDI input device.$(br2)MIMI is implemented in the same way as instrument systems in other games like Rust and Mordhau and you can follow the setup tutorials for those games to setup MIDI for MIMI.$(br2)$(l:https://www.youtube.com/watch?v=wTTGIx2HLt8)Example Video$(/l)"
        },
        {
            "type": "text",
            "title": "MIDI in MIMI",
            "text": "MIMI includes a configuration GUI that allows you to select a MIDI device from your available system devices to provide MIDI input to MIMI.$(br2)This GUI can be accessed by pressing $(l)$(k:key.mimi.midi.settings)$() while in-game and will allow you to select which device MIMI should use to receive MIDI input."
        },
        {
            "type": "text",
            "title": "Instrument MIDI",
            "text": "Each instrument in MIMI allows you to set a MIDI Input mode from the instrument GUI. In order for an instrument to play MIDI data received from the configured input device it must have its MIDI Input mode set to \"MIDI\".$(br2)You can use the channel toggle buttons on the GUI to select which MIDI channels you want this instrument to play."
        },
        {
            "type": "text",
            "title": "Physical MIDI Devices",
            "text": "In order to play MIDI data in MIMI you must have at least one compatible MIDI device available on your system.$(br2)If you have a physical MIDI-enabled device (like a digital piano) that should work with a USB to MIDI adapter as long as your system is able to recognize it. For help with connecting a MIDI device to your system see $(l:https://www.musicrepo.com/how-to-connect-midi-keyboard-to-computer/)here$(/l)."
        },
        {
            "type": "text",
            "title": "Playing MIDI files",
            "text": "If you want to play MIDI files in MIMI you can use a software MIDI device for MIMI input.$(br2)This involves installing a \"MIDI Loopback\" program onto your PC that essentially acts as a fake MIDI device. A loopback program takes a MIDI output that it receives and re-broadcasts it as if it is an input that other programs can pickup."
        },
        {
            "type": "text",
            "title": "Playing MIDI files",
            "text": "There are many loopback programs available; On Windows a popular choice is $(l:https://www.tobias-erichsen.de/software/loopmidi.html)loopMIDI$(/l) and Mac has one $(l:https://help.ableton.com/hc/en-us/articles/209774225-Setting-up-a-virtual-MIDI-bus#Mac)built-in$(/l).$(br2)Once you have a loopback program installed you will need a MIDI player to send data from the file to the loopback program. On Windows one choice is $(l:http://www.vanbasco.com/)vanBasco's Karaoke$(/l) and on Mac you can try $(l:https://apps.apple.com/us/app/midiplayer-x/id954177929)MIDIPlayerX$(/l)."
        },
        {
            "type": "text",
            "title": "Playing MIDI files",
            "text": "Once you have setup a loopback program and a MIDI player that can send data to the loopback program (and configured the player to do so in its settings) you must select the loopback program as the input device within MIMI.$(br2)You can do this by accessing the $(l:configuration_midi_input)MIMI MIDI device configuration GUI$(/l) with the keybind $(l)$(k:key.mimi.midi.settings)$() while in-game."
        },
        {
            "type": "text",
            "title": "Playing MIDI files",
            "text": "If you need more help check out this videos configuring MIDI file playback for the game Rust on Windows. The setup process is the same for MIMI and the video contains several helpful tips to make your in-game songs sound better.$(br2)$(l:https://www.youtube.com/watch?v=wTTGIx2HLt8)Link$(/l)"
        }
    ],
    "sortnum": 2
}