{
    "name": "Using Instruments",
    "icon": "mimi:piano",
    "category": "mimi:overview",
    "pages": [
        {
            "type": "text",
            "text": "MIMI provides two types of instruments: Hand-Held, which can be played from your hand, and Block, which must be placed into the world to play.$(br2)$(l)Note:$() The volume for all MIMI instruments can be set globally by adjusting the 'Players' volume slider in the Minecraft settings menu."
        },
        {
            "type": "crafting",
            "title": "Hand-Held Instrument",
            "recipe": "mimi:acguitar",
            "text": "$(br)Once you've crafted the instrument shown above simply hold it in your main hand and right click to open the Instrument GUI."
        },
        {
            "type": "crafting",
            "title": "Block Instrument",
            "recipe": "mimi:piano",
            "text": "$(br)Once you've crafted the instrument shown above you must place it into the world as a block in order to play it. Once placed, right click on it with an empty hand to sit down and then right click it again to open the Instrument GUI."
        },
        {
            "type": "text",
            "title": "The Instrument GUI",
            "text": "You should now see the instrument GUI on your screen.$(br2)This GUI lets you play the instrument you're holding either by pressing the keys on your keyboard shown on the piano or by simply clicking the note you want to play.$(br2)The GUI also shows the controls for shifting the displayed piano up and down so that you can play lower or higher notes."
        },
        {
            "type": "text",
            "title": "The Instrument GUI",
            "text": "The top right section of the GUI includes a layout toggle which allows you to change the way that piano notes are mapped to keys on your keyboard.$(br2)The note indicators display minimum, maximum, and middles notes on the currently visible portion of the piano."
        },
        {
            "type": "text",
            "title": "The Instrument GUI",
            "text": "The lower half of the GUI shows your current inventory and includes a slot to insert a $(l:overview_switchboard)Switchboard$() into the current instrument.$(br2)Inserting a Switchboard allows you to connect the instrument to a $(l:overview_transmitter)Transmitter$() or enable input from a System MIDI Input device."
        },
        {
            "type": "text",
            "title": "The Instrument GUI",
            "text": "The pencil button next to the Switchboard slot allows you to modify the properties of the current switchboard if one is inserted.$(br2)See the $(l:switchboard_properties)Switchboard Properties$() section of this guide for more information on available Switchboard properties."
        }
    ],
    "sortnum": 1
}