{
    "name": "TLDR; Play a MIDI File",
    "icon": "mimi:acguitar",
    "category": "mimi:overview",
    "pages": [
        {
            "type": "text",
            "text": "There's a lot of information in this guide and reading it can be a bit overwhelming. If you just want to start playing MIDI files ASAP this is the section for you."
        },
        {
            "type": "crafting",
            "title": "1. Craft an Instrument",
            "recipe": "mimi:acguitar",
            "text": "$(br)The first thing you'll need is an instrument to play. If you just want to play notes yourself this is all you need."
        },
        {
            "type": "crafting",
            "title": "2. Craft a FileCaster",
            "recipe": "mimi:filecaster",
            "text": "$(br)In order to play songs you'll need a FileCaster."
        },
        {
            "type": "crafting",
            "title": "3. Craft a Switchboard",
            "recipe": "mimi:switchboard",
            "text": "$(br)In order to connect your instrument to your filecaster you'll need a Switchboard."
        },
        {
            "type": "text",
            "title": "4. Open the Instrument",
            "text": "Hold your crafted instrument in your main hand (unless it's a Block Instrument, in which case place it in the world) then right click to open the Instrument GUI.$(br2)Insert your Switchboard into the corresponding slot in the GUI."
        },
        {
            "type": "text",
            "title": "5. Connect a FileCaster",
            "text": "Click the pencil button next to the Switchboard slot to open the Switchboard config panel.$(br2)Click the 'PUB' button under 'Linked FileCaster' and then click the `O` button under `Channels` section.$(br2)Finally, click the button for channel 10 again to turn it off. Channel 10 is almost always used for percussion so unless you're playing the Drum Kit you should usually turn it off."
        },
        {
            "type": "text",
            "title": "6. Start a Song",
            "text": "Close the Instrument GUI and switch your hand to your FileCaster and then right click to open the FileCaster GUI.$(br2)Type the folder path on your system that contains your MIDI files in the bar at the top and then press the load folder button.$(br2)Select a song and press the play button."
        },
        {
            "type": "text",
            "title": "7. Play your Instrument",
            "text": "Close the FileCaster GUI and switch your hand back to your Instrument.$(br2)Your song should now be playing!"
        },
        {
            "type": "text",
            "title": "8. Play Together",
            "text": "Want others to play your song with you? Have them follow the same steps above (without steps 2 and 6) and they'll automatically start playing the song from your FileCaster as well."
        }
    ],
    "sortnum": 0
}