{
    "name": "Properties",
    "icon": "minecraft:paper",
    "category": "mimi:switchboard",
    "pages": [
        {
            "type": "text",
            "text": "The Switchboard can store several different properties which are used by different blocks and items within MIMI. Hovering your mouse over a Switchboard in your inventory will allow you to see the current properties set on it."
        },
        {
            "type": "text",
            "title": "Linked Transmitter",
            "text": "This property stores which nearby Transmitter(s) the Switchboard will receive notes from when the Transmitter is broadcasting.$(br2)When set to `Public` mode the Switchboard will receive notes from all Transmitters that are broadcasting in public mode.$(br2)When set to a specific player's Transmitter the Switchboard will only receive notes from that player."
        },
        {
            "type": "text",
            "title": "Setting Transmitter",
            "text": "The Linked Transmitter can be set from the GUI of any item or block that accepts a Switchboard and uses the Linked Transmitter property. The GUI allows you to link to either Public Transmitters or your own Transmitter.$(br2)If you want to link to another player's transmitter you can hold the Switchboard in your main hand and then right click on the desired player to link to them."
        },
        {
            "type": "text",
            "title": "System MIDI Device",
            "text": "This property stores whether or not this Switchboard should respond to input received from the configured System MIDI Input Device (if any)."
        },
        {
            "type": "text",
            "title": "MIDI Channels",
            "text": "A MIDI file is able to play 16 different instruments at a time. Each instrument is assigned a number - called a channel - and notes for that instrument are sent to that channel. A Switchboard can be configured to receive data from specific channels, all channels, or no channels.$(br2)$(l)Channel 10$() is almost always used for percussion and this doesn't generally work well for other instruments."
        },
        {
            "type": "text",
            "title": "MIDI Channels",
            "text": "Note that when receiving data from a System MIDI Input Device you should consult the user manual for the device to determine which channels it broadcasts its data on and ensure that those are enabled on the Switchboard."
        },
        {
            "type": "text",
            "title": "MIDI Channels",
            "text": "Also note that it is generally recommended to enable only some channels at the same time because if the same note is played on multiple enabled channels simultaneously it could cause minor issues with note timing sustain as the note on one channel may last longer than the note on another channel."
        },
        {
            "type": "text",
            "title": "Filter: Note",
            "text": "This property stores which note(s) this Switchboard should respond to. You can set it to a specific note, any note from a specific octave, any octave of a specific note, or any note of any octave.$(br2)You can also invert the filter so that the Switchboard will respond to all notes $(i)except$() for the notes configured by the filter."
        },
        {
            "type": "text",
            "title": "Filter: Instrument",
            "text": "This property stores which Instrument(s) this Switchboard should respond to. You can set it to a specific Instrument or any Instrument.$(br2)You can also invert the filter so that the Switchboard will respond to all Instruments $(i)except$() for the Instrument configured by the filter."
        },
        {
            "type": "text",
            "title": "Broadcast: Mode",
            "text": "This property stores which $(l:transmitter_modes)Transmitter Mode$() this Switchboard should use when inserted into a block that can transmit notes, such as the $(l:redstone_conductor)Conductor$().$(br2)Note that Switchboards do not support the 'Self' Transmitter Mode."
        },
        {
            "type": "text",
            "title": "Broadcast: Note",
            "text": "This property stores which note this Switchboard should broadcast when inserted into a block that block that can transmit notes, such as the $(l:redstone_conductor)Conductor$()."
        }
    ],
    "sortnum": 1
}