{
    "name": "Playlist GUI",
    "icon": "minecraft:music_disc_13",
    "category": "mimi:transmitter",
    "pages": [
        {
            "type": "text",
            "text": "The Playlist GUI can be accessed either by right clicking while holding a Transmitter item or by pressing the configured Playlist GUI keybind when at least one Transmitter is on your hotbar. $(br2)The current keybind is: $(l)$(k:key.mimi.midi.playlist)$()"
        },
        {
            "type": "text",
            "title": "Playlist Folder",
            "text": "The top section of the Playlist GUI allows to specify which folder on your system should be loaded into the playlist. If you type a valid folder path the text will appear white, otherwise it will appear red.$(br2)Once a folder has been entered press the open button to load the folder into the playlist, replacing any existing playlist if one is loaded."
        },
        {
            "type": "text",
            "title": "Playlist Folder",
            "text": "Note that if you have set a default playlist folder using the mod $(l:config_file)Config File$(/l) the configured folder will be loaded into the Playlist GUI when you join a world."
        },
        {
            "type": "text",
            "title": "Song List",
            "text": "Once a folder has been loaded the screen below the folder path should populate with a list of available songs in the specified folder. Each song is assigned a track number and the currently selected song will have a green box aruond it.$(br2)The song list will scroll up and down as the selected song changes."
        },
        {
            "type": "text",
            "title": "Channel-Instrument Map",
            "text": "When a song is selected the screen below the Song List will show what MIDI program (instrument) is assigned to each of the song's 16 tracks.$(br2)This view will help you decide which of your MIMI instruments should listen to which MIDI channels and inform anyone that you're playing along with of which channels each of their instruments should have enabled."
        },
        {
            "type": "text",
            "title": "Media Controls",
            "text": "The bottom left section of the Playlist GUI contains the media playback controls which allow you to perform standard mieda actions on the loaded playlist such as: Play, Pause, Stop, Skip, and Reverse Skip.$(br2)In the bottom right of the GUI you will see the song progress slider which shows the current playback position of the selected song. Note that at this time you cannot interact with the slider."
        },
        {
            "type": "text",
            "title": "Loop and Shuffle",
            "text": "The bottom middle section of the Playlist GUI contains the toggle buttons for the playlist loop modes (loop single, loop all, and loop none) and playlist shuffle mode.$(br2)The buttons themselves toggle between the different available modes for each setting and the screen to the right of each button shows the currently selected mode."
        },
        {
            "type": "text",
            "title": "Transmit Mode",
            "text": "The bottom middle section of the Playlist GUI also contains the toggle button for the $(l:transmitter_modes)Transmit Modes$(/l).$(br2)Pressing the button cycles between the available modes and the screen to the right shows the current mode (P = Public, L = Linked, S = Self)."
        }
    ],
    "sortnum": 1
}