{
    "name": "Transmitter Usage",
    "icon": "mimi:transmitter",
    "category": "mimi:transmitter",
    "pages": [
        {
            "type": "text",
            "text": "The MIDI Transmitter in MIMI provides the ability to play MIDI files from your system in MIMI and broadcast the notes not only to your own instruments but also to other nearby instruments. $(br2)Once you've crafted the $(l:overview_transmitter)MIDI Transmitter$(/l) simply hold it in your main hand and right click to open the Transmitter GUI."
        },
        {
            "type": "text",
            "title": "Loading Songs",
            "text": "Once you've opened the Transmitter GUI you can select a folder from your system to open and load songs from.$(br2)Note that the playlist is not saved to the transmitter itself but is instead saved globally and all transmitters will open the same playlist (similar to how all Ender Chests open the same inventory)."
        },
        {
            "type": "text",
            "title": "Loading Songs",
            "text": "The playlist is not saved when you logout of a world or close the game and the playlist folder must be loadead again each time you join a world$(br2)In the mod $(l:config_file)Config File$(/l) you can set a default folder to load when joining a world so that you don't have to reload the folder every time."
        },
        {
            "type": "text",
            "title": "Playing Songs",
            "text": "The Transmitter GUI includes media controls that allow you to play songs and shift around the loaded playlist.$(br2)When a song is selected you will see a mapping of which instruments are assigned to each of the song's 16 channels. This mapping allows you to decide which channels each of your instruments should have enabled and inform anyone that you're playing along with which channels they should enable."
        },
        {
            "type": "text",
            "title": "Playing Songs",
            "text": "Note that every song will have a different channel-instrument mapping so when switching songs you will likely want to change which channels your instruments have enabled.$(br2)The only exception to this is $(l)Channel 10$() which is almost exclusively used for percussion and should almost always the only enabled channel on the drums and be disabled on all other instruments."
        },
        {
            "type": "text",
            "title": "Playing Songs",
            "text": "Songs from the playlist will only play when there is at least one transmitter item on your hotbar. If a song is playing and all transmitters are removed from your hotbar the song will stop playing.$(br2)When a transmitter is in your hotbar you can access its GUI quickly by pressing the configured Transmitter GUI keybind. $(br2)The current keybind is: $(l)$(k:key.mimi.midi.playlist)$()"
        },
        {
            "type": "text",
            "title": "Transmitting Songs",
            "text": "When a song is being played it will be transmitted to all nearby instruments (within 16 blocks) using the selected $(l:transmitter_modes)Transmit Mode.$(/l)$(br2)If a nearby instrument is being played, has MIDI enabled, and has a compatible MIDI Source configured, all notes from the song will be sent to it and then will be played if the instrument has the corresponding channels enabled."
        }
    ],
    "sortnum": 0
}