{
    "name": "The Instrument Screen",
    "icon": "minecraft:oak_sign",
    "category": "mimi:2instruments",
    "pages": [
        {
            "type": "patchouli:text",
            "text": "The Instrument Screen is the screen that you see upon right-clicking a handheld or block instrument which allows you to directly play the instrument and configure its MIDI settings."
        },
        {
            "type": "patchouli:text",
            "title": "Playing",
            "text": "You can directly play the instrument that you have opened using the keyboard as shown on the piano keys on the screen, or by just clicking on the piano keys.$(br2)If you hold down Space while playing, notes will hold in the same way as holding the sustain pedal on a piano.$(br2)You can change the piano keyboard layout with the button in the top-right corner."
        },
        {
            "type": "patchouli:text",
            "title": "Key Layouts",
            "text": "$(li)$(l)MIMI$() - Keyboard keys are assigned only to currently visible piano keys and are not case-sensitive.$(br)$(li)$(l)VPiano$() - Based on $(o)virtualPiano.net$(), assigns each keyboard key to a specific piano key meaning you can play keys that are $(o)not$() currently visible but cannot play very high or very low notes. Keyboard keys in this layout are case-sensitive."
        },
        {
            "type": "patchouli:text",
            "title": "Shifting",
            "text": "The notes currently visible on screen can be shifted using the 'Visible Note Shift' buttons. You can also shift notes in the same way using the Keyboard:$(br)$(li)By Note: Left/Right Arrows$(br)$(li)By Octave: Up/Down Arrows$(br2)The colored bars on the piano keys match with the note indicators in the shift section to show what notes are visible."
        },
        {
            "type": "patchouli:text",
            "title": "MIDI Settings",
            "text": "MIMI instruments can also be played by a MIDI file (by linking them to a Transmitter) or with a MIDI Input Device attached to your PC.$(br2)Clicking the Edit (pencil icon) button will bring up a menu that allows you to modify the instruments's MIDI settings. Clicking the Edit button again while the menu is open will close the menu."
        },
        {
            "type": "patchouli:text",
            "text": "$(li)$(l)System MIDI Device$() - Whether or not this instrument should play notes from a MIDI Input Device attached to your PC.$(br)$(li)$(l)Volume$() - How loud notes from this instrument should be played.$(br)$(li)$(l)Transmission Source$() - What transmitter this instrument is linked to (will play notes from). You can link to yourself or unlink with the \"ME\" and \"X\" buttons."
        },
        {
            "type": "patchouli:text",
            "text": "$(li)$(l)Enabled MIDI Channels$() - Which MIDI Channels this instrument should play notes from if linked to a transmitter or system MIDI input device.$(br2)MIDI Channels represent separate parts of the song (like piano, guitar, and drums). MIDI files can have up 16 Channels, but may only have 1. Channel 10 is usually for drums and will likely sound bad on other instruments. MIDI input devices usually use Channels 1 or 2."
        }
    ],
    "sortnum": 3
}